In [12]:
import pandas as pd

In [15]:
'''
Load data into dfs
'''
df = pd.read_csv("../data/df_final_demo.txt")
df1 = pd.read_csv("../data/df_final_web_data_pt_1.txt")
df2 = pd.read_csv("../data/df_final_web_data_pt_2.txt")
df3 = pd.read_csv("../data/df_final_experiment_clients.txt")

In [22]:
'''
Combining data to work on a single file
'''
df_final_web_data = pd.concat([df1, df2])
df3.columns = pd.Series(df3.columns).apply(lambda x:x.lower().replace(" ","_"))
df_merge = pd.merge(df_final_web_data, df3, on='client_id', how='outer')
df_final = pd.merge(df_merge, df, on='client_id', how='outer')

In [20]:
df_merge.shape

(755405, 6)

In [23]:
df_final.shape

(755405, 14)

### Display & Check data frames

In [21]:
df_merge[df_merge['variation'].isnull()].count()

client_id       434096
visitor_id      434096
visit_id        434096
process_step    434096
date_time       434096
variation            0
dtype: int64

In [14]:
display(df1.head(3), df2.head(3), df3.head(3), df.head(3))

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0

In [6]:
display(df1.shape, df2.shape, df_final_web_data.shape, df_merge.shape)
#display(df1.shape, df2.shape, df3.shape, df.shape)

(343141, 5)

(412264, 5)

(755405, 5)

(755405, 6)

In [9]:
display(df_merge.head(), df_final_web_data.head(3))

,client_id,visitor_id,visit_id,process_step,date_time,variation
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07,Test
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51,Test
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22,Test
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13,Test
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04,Test

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22

In [20]:
df3.nunique()

client_id    70609
Variation        2
dtype: int64

In [28]:
df1.loc[df1['client_id'] == 9988021]

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
5,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:17:15
6,9988021,580560515_7732621733,781255054_21935453173_531117,step_1,2017-04-17 15:17:01
7,9988021,580560515_7732621733,781255054_21935453173_531117,start,2017-04-17 15:16:22
129,9988021,580560515_7732621733,219729223_42518459208_211914,start,2017-04-12 18:54:43
130,9988021,580560515_7732621733,219729223_42518459208_211914,start,2017-04-12 18:38:42
131,9988021,580560515_7732621733,219729223_42518459208_211914,start,2017-04-12 18:22:40
132,9988021,580560515_7732621733,219729223_42518459208_211914,start,2017-04-12 18:06:39
133,9988021,580560515_7732621733,219729223_42518459208_211914,start,2017-04-12 17:50:38
161,9988021,580560515_7732621733,219729223_42518459208_211914,start,2017-04-12 17:34:37
162,9988021,580560515_7732621733,219729223_42518459208_211914,start,2017-04-12 16:57:27

In [24]:
df2.client_id.nunique()

67430